In [1]:
import pandas as pd

In [12]:
x=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
x.values

array([1, 2, 3, 4, 5], dtype=int64)

In [19]:
x.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [14]:
x['a']

1

In [16]:
x[x>3]

d    4
e    5
dtype: int64

In [20]:
x*5

a     5
b    10
c    15
d    20
e    25
dtype: int64

In [23]:
'a' in x

True

In [24]:
'z' in x

False

In [25]:
5 in x.values

True

In [26]:
x.isnull()

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [27]:
x.notnull()

a    True
b    True
c    True
d    True
e    True
dtype: bool

In [31]:
x={
    'name':['majid','arif'],
    'age':[21,46],
    'gender':['male','male']
}
frame=pd.DataFrame(x)
frame

    name  age gender
0  majid   21   male
1   arif   46   male

In [32]:
frame.name

0    majid
1     arif
Name: name, dtype: object

In [35]:
frame[frame.age>45]

   name  age gender
1  arif   46   male

In [36]:
frame.loc[0]

name      majid
age          21
gender     male
Name: 0, dtype: object

In [37]:
frame['age']=35

In [38]:
frame

    name  age gender
0  majid   35   male
1   arif   35   male

In [39]:
frame['minage']=18
frame

    name  age gender  minage
0  majid   35   male      18
1   arif   35   male      18

In [40]:
frame.name

0    majid
1     arif
Name: name, dtype: object

In [41]:
del frame['minage']

In [42]:
frame.columns

Index(['name', 'age', 'gender'], dtype='object')

In [64]:
frame.T

            0     1
name    majid  arif
age        35    35
gender   male  male

In [44]:
frame['name']

0    majid
1     arif
Name: name, dtype: object

In [54]:
frame.loc[0]

name      majid
age          35
gender     male
Name: 0, dtype: object

In [55]:
frame.iloc[1]

name      arif
age         35
gender    male
Name: 1, dtype: object

In [56]:
import numpy as np

In [57]:
np.sin(frame.age)

0   -0.428183
1   -0.428183
Name: age, dtype: float64

In [58]:
np.cos(frame.age)

0   -0.903692
1   -0.903692
Name: age, dtype: float64

In [75]:
def myFun(age):
    if (age>=18):
        return 'Adult'
    else:
        return 'Not Adult'

In [76]:
frame.age

0    35
1    35
Name: age, dtype: int64

In [77]:
frame.age.apply(myFun)

0    Adult
1    Adult
Name: age, dtype: object

In [69]:
frame

    name  age gender
0  majid   35   male
1   arif   35   male

In [103]:
y={
    'name':['majid arif','arif nawaz'],
    'age':[21,46],
    'gender':['male','male']
}
frame=pd.DataFrame(y)
frame

         name  age gender
0  majid arif   21   male
1  arif nawaz   46   male

In [104]:
def myfun(name):
    return name.split()[-1]

In [105]:
frame.name.apply(myfun)

0     arif
1    nawaz
Name: name, dtype: object